frontend/controllers/SiteController.php

    public function actionIndex() {
        // 开奖号码数据
        $models = WinningNumbers::find()->all();
        $arr = array(
            'datenumber' => '',
            'red1' => '',
            'red2' => '',
            'red3' => '',
            'red4' => '',
            'red5' => '',
            'red6' => '',
            'blue' => '',
        );
        foreach ($models as $model) {
            $arr['datenumber'] .= $model->datenumber . "|";
            $arr['red1'] .= $model->red1 . "|";
            $arr['red2'] .= $model->red2 . "|";
            $arr['red3'] .= $model->red3 . "|";
            $arr['red4'] .= $model->red4 . "|";
            $arr['red5'] .= $model->red5 . "|";
            $arr['red6'] .= $model->red6 . "|";
            $arr['blue'] .= $model->blue . "|";
        }
        // 留言板数据
        $messages = Message::find()->orderBy('id desc')->all();
---
SELECT * FROM `winningnumbers`
SELECT * FROM `message` ORDER BY `id` DESC

    public function actionMessage() {
        $message = new Message();
        $address = Utils::getAddress();
        if (isset($address->city)) {
            $message->username = $address->city;
        } else if (isset($address->region)) {
            $message->username = $address->region;
        } else if (isset($address->country)) {
            $message->username = $address->country;
        } else {
            $message->username = "火星";
        }
        $message->username.="彩民";
        $message->message = Yii::$app->request->post('message');
        $message->time = date('Y-m-d H:i:s');
        $message->up = 0;
        $message->down = 0;
        $message->save();
---
INSERT INTO `message` (`username`, `message`, `time`, `up`, `down`) VALUES ('火星彩民', 'aaa', '2017-02-06 09:01:16', 0, 0)