common/models/WinningNumbers.php

    public static function checkRed($x, $y) {
        $time = 0;
        $winnigNumbers = self::find()->asArray()->all();
---
SELECT * FROM `winningnumbers`

    public static function checkBlue($x) {
        $time = 0;
        $winnigNumbers = self::find()->asArray()->all();
---
SELECT * FROM `winningnumbers`